app/views/forms/index.html.erb

        <h3>
          <% template.template_questions.each do |question| %>
---
SELECT "template_questions".* FROM "template_questions" WHERE "template_questions"."template_id" = ?  [["template_id", 1]]
SELECT "templates".* FROM "templates"