app/controllers/forms_controller.rb

  def index
    t = Template.create!(name: "teste")
    question = t.template_questions.create!(question_type: "text", question_text: "teste de pergunta")
    @templates = Template.all
---
INSERT INTO "templates" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "teste"], ["created_at", "2024-05-18 22:53:18.120749"], ["updated_at", "2024-05-18 22:53:18.120749"]]
INSERT INTO "template_questions" ("template_id", "question_type", "question_text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["template_id", 1], ["question_type", "text"], ["question_text", "teste de pergunta"], ["created_at", "2024-05-18 23:02:29.103837"], ["updated_at", "2024-05-18 23:02:29.103837"]]
SELECT "templates".* FROM "templates"